tap "fluxcd/tap"
tap "hashicorp/tap"
tap "nats-io/nats-tools"
tap "patrickdappollonio/tap"
brew "age"
brew "bat"
brew "jq"
brew "ksops"
brew "kubernetes-cli"
brew "kustomize"
brew "libass"
brew "mkcert"
brew "node"
brew "pure"
brew "skaffold"
brew "sops"
brew "step"
brew "stow"
brew "tesseract"
brew "tree"
brew "unar"
brew "watch"
brew "yarn"
brew "yq"
brew "yt-dlp"
brew "zsh-syntax-highlighting"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "nats-io/nats-tools/nats"
brew "nats-io/nats-tools/nsc"
brew "patrickdappollonio/tap/kubectl-slice"
cask "secretive"
cask "slack"
cask "soulseek"
cask "webull"
