tap "fluxcd/tap"
tap "hashicorp/tap"
tap "nats-io/nats-tools"
tap "patrickdappollonio/tap"
brew "age"
brew "awscli"
brew "bat"
brew "bind"
brew "cocoapods"
brew "doctl"
brew "ffmpeg"
brew "gnupg"
brew "harfbuzz"
brew "helm"
brew "ios-deploy"
brew "jq"
brew "ksops"
brew "kubernetes-cli"
brew "kustomize"
brew "libass"
brew "mkcert"
brew "ncftp"
brew "node"
brew "openjdk"
brew "pango"
brew "pure"
brew "rbenv"
brew "skaffold"
brew "sops"
brew "step"
brew "stow"
brew "tesseract"
brew "tree"
brew "unar"
brew "watch"
brew "yarn"
brew "yq"
brew "yt-dlp"
brew "zsh-syntax-highlighting"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "nats-io/nats-tools/nats"
brew "nats-io/nats-tools/nsc"
brew "patrickdappollonio/tap/kubectl-slice"
cask "lm-studio"
cask "mitmproxy"
cask "rekordbox"
cask "secretive"
cask "slack"
cask "soulseek"
cask "webull"
