# -----------------------------
# Taps
# -----------------------------
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "nats-io/nats-tools"
tap "patrickdappollonio/tap"


# -----------------------------
# Core CLI tools
# -----------------------------
brew "bat"
brew "jq"
# brew "yq"
brew "tree"
# brew "watch"
brew "stow"


# -----------------------------
# Development (languages & runtimes)
# -----------------------------
brew "node"
# brew "yarn"
# brew "rbenv"
# brew "openjdk"


# -----------------------------
# Kubernetes / DevOps
# -----------------------------
brew "kubernetes-cli"
# brew "helm"
brew "kustomize"
brew "skaffold"
brew "fluxcd/tap/flux"
brew "patrickdappollonio/tap/kubectl-slice"


# -----------------------------
# Cloud / Infrastructure
# -----------------------------
# brew "awscli"
brew "doctl"
# brew "hashicorp/tap/terraform"
brew "hashicorp/tap/packer"


# -----------------------------
# Security / Secrets
# -----------------------------
# brew "gnupg"
brew "sops"
brew "age"
# brew "step"


# -----------------------------
# Mobile / React Native
# -----------------------------
# brew "cocoapods"
# brew "ios-deploy"


# -----------------------------
# Messaging / Streaming
# -----------------------------
brew "nats-io/nats-tools/nats"
brew "nats-io/nats-tools/nsc"


# -----------------------------
# Networking / Utilities
# -----------------------------
# brew "bind"
brew "ncftp"
brew "mkcert"


# -----------------------------
# Media / Processing (optional)
# -----------------------------
brew "ffmpeg"
brew "yt-dlp"
# brew "tesseract"
# brew "unar"


# -----------------------------
# Shell enhancements
# -----------------------------
brew "zsh-syntax-highlighting"
brew "pure"


# -----------------------------
# Applications
# -----------------------------
cask "iterm2"
cask "visual-studio-code"

# Useful apps
# cask "slack"
cask "mitmproxy"
# cask "lm-studio"
cask "secretive"

# Personal / optional
# cask "rekordbox"
# cask "soulseek"
# cask "webull"
